# -*- coding: utf-8 -*-

# Данные о времени сна
SLEEP_SCHEDULE = {
    '6:00': ['20:45', '22:15'],
    '6:30': ['21:15', '22:45'],
    '7:00': ['21:45', '23:15'],
    '7:30': ['22:15', '23:45'],
    '8:00': ['22:45', '00:15'],
    '8:30': ['23:15', '00:45'],
    '9:00': ['23:45', '01:15'],
    '9:30': ['00:15', '01:45']
}

# Названия достижений
ACHIEVEMENT_NAMES = {
    'newbie': 'Сонный новичок',
    'expert': 'Сонный эксперт',
    'master': 'Мастер сна',
    'lord': 'Повелитель снов',
    'early_bird': 'Ранняя пташка',
    'night_owl': 'Ночная сова',
    'perfect_sleep': 'Идеальный сон',
    'stable_regime': 'Стабильный режим'
}